docs/recs/change dates/MyFlow 23-9-2018/9-ARR_RetrieveAirAvailability.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:sita="http://schemas.datacontract.org/2004/07/Sita.Services.ARR" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<hal:Config subscriberId="7I" xmlns:hal="http://sita.aero/hal"/>
	</soapenv:Header>
	<soapenv:Body>
		<tem:ARR_RetrieveAirAvailability>
			<tem:sessionID>d33f24af-e49b-41e7-99b6-c88cd1d06a39</tem:sessionID>
			<tem:ARR_RetrieveAirAvailabilityRQ>
				<sita:displayOptionsField xsi:nil="true"/>
				<sita:originDestinationInformationField>
					<sita:arrivalLocationField>
						<sita:locationCodeField>CUR</sita:locationCodeField>
					</sita:arrivalLocationField>
					<sita:connectionLocationsField xsi:nil="true"/>
					<sita:departureDateField>2018-09-30</sita:departureDateField>
					<sita:departureLocationField>
						<sita:locationCodeField>BON</sita:locationCodeField>
					</sita:departureLocationField>
					<sita:departureTimeField xsi:nil="true"/>
				</sita:originDestinationInformationField>
				<sita:specificFlightInfoField>
					<sita:airlineField>
						<sita:codeField>7I</sita:codeField>
					</sita:airlineField>
				</sita:specificFlightInfoField>
			</tem:ARR_RetrieveAirAvailabilityRQ>
		</tem:ARR_RetrieveAirAvailability>
	</soapenv:Body>
</soapenv:Envelope>
